JohnnyB1290/jblib-platform-abstract-jbkernel/include/jbkernel/lpc43xx_jbdrivers_opts.h
/**
 * @file
 * @brief Options for LPC43XX JB Drivers
 *
 *
 * @note
 * Copyright © 2019 Evgeniy Ivanov. Contacts: <strelok1290@gmail.com>
 * All rights reserved.
 * @note
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 * @note
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @note
 * This file is a part of JB_Lib.
 */

#ifndef LPC43XX_JBDRIVERS_OPTS_H_
#define LPC43XX_JBDRIVERS_OPTS_H_

typedef struct{
	unsigned char port;
	unsigned char pin;
	unsigned char gpioPort;
	unsigned char gpioPin;
	unsigned char scuMode;
}BoardGpio_t;

/*
   ------------------------------------
   ------------- JBKERNEL -------------
   ------------------------------------
*/

/**
 * JBKERNEL_NUM_NOP_DELAY_US
 */
#if !defined JBKERNEL_NUM_NOP_DELAY_US
#define JBKERNEL_NUM_NOP_DELAY_US			39  //For 204 MHz clock  (for O3 optimization)
#endif

/**
 * JBKERNEL_NUM_NOP_DELAY_MS
 */
#if !defined JBKERNEL_NUM_NOP_DELAY_MS
#define JBKERNEL_NUM_NOP_DELAY_MS 			40824  //For 204 MHz clock  (for O3 optimization)
#endif

/*
   ------------------------------------
   ------------- JBCONTROLLER ---------
   ------------------------------------
*/

/**
 * JBCONTROLLER_BOARD_GPIOS
 */
#if !defined JBCONTROLLER_BOARD_GPIOS
#define JBCONTROLLER_BOARD_GPIOS				{{2, 12, 1, 12, SCU_MODE_FUNC0},\
											 	 {2, 11, 1, 11, SCU_MODE_FUNC0},}
#endif

/*
   ------------------------------------
   ----------- Ethernet Phy -----------
   ------------------------------------
*/

/**
 * ETHERNET_PHY_USE_RESET_PIN
 */
#if !defined ETHERNET_PHY_USE_RESET_PIN
#define ETHERNET_PHY_USE_RESET_PIN			1
#endif

#if ETHERNET_PHY_USE_RESET_PIN

/**
 * ETHERNET_PHY_RESET
 */
#if !defined ETHERNET_PHY_RESET_PORT
#define ETHERNET_PHY_RESET_PORT					1
#endif
#if !defined ETHERNET_PHY_RESET_PIN
#define ETHERNET_PHY_RESET_PIN					0
#endif
#if !defined ETHERNET_PHY_RESET_GPIO_PORT
#define ETHERNET_PHY_RESET_GPIO_PORT			0
#endif
#if !defined ETHERNET_PHY_RESET_GPIO_PIN
#define ETHERNET_PHY_RESET_GPIO_PIN				4
#endif
#if !defined ETHERNET_PHY_RESET_SCU_MODE
#define ETHERNET_PHY_RESET_SCU_MODE				SCU_MODE_FUNC0
#endif

#endif

/**
 * ETHERNET_PHY_TXD0
 */
#if !defined ETHERNET_PHY_TXD0_PORT
#define ETHERNET_PHY_TXD0_PORT					1
#endif
#if !defined ETHERNET_PHY_TXD0_PIN
#define ETHERNET_PHY_TXD0_PIN					18
#endif
#if !defined ETHERNET_PHY_TXD0_SCU_MODE
#define ETHERNET_PHY_TXD0_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_TXD1
 */
#if !defined ETHERNET_PHY_TXD1_PORT
#define ETHERNET_PHY_TXD1_PORT					1
#endif
#if !defined ETHERNET_PHY_TXD1_PIN
#define ETHERNET_PHY_TXD1_PIN					20
#endif
#if !defined ETHERNET_PHY_TXD1_SCU_MODE
#define ETHERNET_PHY_TXD1_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_TXEN
 */
#if !defined ETHERNET_PHY_TXEN_PORT
#define ETHERNET_PHY_TXEN_PORT					0
#endif
#if !defined ETHERNET_PHY_TXEN_PIN
#define ETHERNET_PHY_TXEN_PIN					1
#endif
#if !defined ETHERNET_PHY_TXEN_SCU_MODE
#define ETHERNET_PHY_TXEN_SCU_MODE				SCU_MODE_FUNC6
#endif

/**
 * ETHERNET_PHY_RXD0
 */
#if !defined ETHERNET_PHY_RXD0_PORT
#define ETHERNET_PHY_RXD0_PORT					1
#endif
#if !defined ETHERNET_PHY_RXD0_PIN
#define ETHERNET_PHY_RXD0_PIN					15
#endif
#if !defined ETHERNET_PHY_RXD0_SCU_MODE
#define ETHERNET_PHY_RXD0_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_RXD1
 */
#if !defined ETHERNET_PHY_RXD1_PORT
#define ETHERNET_PHY_RXD1_PORT					0
#endif
#if !defined ETHERNET_PHY_RXD1_PIN
#define ETHERNET_PHY_RXD1_PIN					0
#endif
#if !defined ETHERNET_PHY_RXD1_SCU_MODE
#define ETHERNET_PHY_RXD1_SCU_MODE				SCU_MODE_FUNC2
#endif

/**
 * ETHERNET_PHY_CRS_DV
 */
#if !defined ETHERNET_PHY_CRS_DV_PORT
#define ETHERNET_PHY_CRS_DV_PORT				1
#endif
#if !defined ETHERNET_PHY_CRS_DV_PIN
#define ETHERNET_PHY_CRS_DV_PIN					16
#endif
#if !defined ETHERNET_PHY_CRS_DV_SCU_MODE
#define ETHERNET_PHY_CRS_DV_SCU_MODE			SCU_MODE_FUNC7
#endif

/**
 * ETHERNET_PHY_MDIO
 */
#if !defined ETHERNET_PHY_MDIO_PORT
#define ETHERNET_PHY_MDIO_PORT					1
#endif
#if !defined ETHERNET_PHY_MDIO_PIN
#define ETHERNET_PHY_MDIO_PIN					17
#endif
#if !defined ETHERNET_PHY_MDIO_SCU_MODE
#define ETHERNET_PHY_MDIO_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_MDC
 */
#if !defined ETHERNET_PHY_MDC_PORT
#define ETHERNET_PHY_MDC_PORT					2
#endif
#if !defined ETHERNET_PHY_MDC_PIN
#define ETHERNET_PHY_MDC_PIN					0
#endif
#if !defined ETHERNET_PHY_MDC_SCU_MODE
#define ETHERNET_PHY_MDC_SCU_MODE				SCU_MODE_FUNC7
#endif

/**
 * ETHERNET_PHY_REF_CLK
 */
#if !defined ETHERNET_PHY_REF_CLK_PORT
#define ETHERNET_PHY_REF_CLK_PORT				1
#endif
#if !defined ETHERNET_PHY_REF_CLK_PIN
#define ETHERNET_PHY_REF_CLK_PIN				19
#endif
#if !defined ETHERNET_PHY_REF_CLK_SCU_MODE
#define ETHERNET_PHY_REF_CLK_SCU_MODE			SCU_MODE_FUNC0
#endif

/**
 * ETHERNET_PHY_USE_MII
 */
#if !defined ETHERNET_PHY_USE_MII
#define ETHERNET_PHY_USE_MII					1
#endif

#if ETHERNET_PHY_USE_MII

/**
 * ETHERNET_PHY_RX_ER
 */
#if !defined ETHERNET_PHY_RX_ER_PORT
#define ETHERNET_PHY_RX_ER_PORT					0x0C
#endif
#if !defined ETHERNET_PHY_RX_ER_PIN
#define ETHERNET_PHY_RX_ER_PIN					9
#endif
#if !defined ETHERNET_PHY_RX_ER_SCU_MODE
#define ETHERNET_PHY_RX_ER_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_RXDV
 */
#if !defined ETHERNET_PHY_RXDV_PORT
#define ETHERNET_PHY_RXDV_PORT					0x0C
#endif
#if !defined ETHERNET_PHY_RXDV_PIN
#define ETHERNET_PHY_RXDV_PIN					8
#endif
#if !defined ETHERNET_PHY_RXDV_SCU_MODE
#define ETHERNET_PHY_RXDV_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_RXD2
 */
#if !defined ETHERNET_PHY_RXD2_PORT
#define ETHERNET_PHY_RXD2_PORT					9
#endif
#if !defined ETHERNET_PHY_RXD2_PIN
#define ETHERNET_PHY_RXD2_PIN					3
#endif
#if !defined ETHERNET_PHY_RXD2_SCU_MODE
#define ETHERNET_PHY_RXD2_SCU_MODE				SCU_MODE_FUNC5
#endif

/**
 * ETHERNET_PHY_RXD3
 */
#if !defined ETHERNET_PHY_RXD3_PORT
#define ETHERNET_PHY_RXD3_PORT					9
#endif
#if !defined ETHERNET_PHY_RXD3_PIN
#define ETHERNET_PHY_RXD3_PIN					2
#endif
#if !defined ETHERNET_PHY_RXD3_SCU_MODE
#define ETHERNET_PHY_RXD3_SCU_MODE				SCU_MODE_FUNC5
#endif

/**
 * ETHERNET_PHY_RXCLK
 */
#if !defined ETHERNET_PHY_RXCLK_PORT
#define ETHERNET_PHY_RXCLK_PORT					0x0C
#endif
#if !defined ETHERNET_PHY_RXCLK_PIN
#define ETHERNET_PHY_RXCLK_PIN					0
#endif
#if !defined ETHERNET_PHY_RXCLK_SCU_MODE
#define ETHERNET_PHY_RXCLK_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_TXD2
 */
#if !defined ETHERNET_PHY_TXD2_PORT
#define ETHERNET_PHY_TXD2_PORT					0x0C
#endif
#if !defined ETHERNET_PHY_TXD2_PIN
#define ETHERNET_PHY_TXD2_PIN					2
#endif
#if !defined ETHERNET_PHY_TXD2_SCU_MODE
#define ETHERNET_PHY_TXD2_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_TXD3
 */
#if !defined ETHERNET_PHY_TXD3_PORT
#define ETHERNET_PHY_TXD3_PORT					0x0C
#endif
#if !defined ETHERNET_PHY_TXD3_PIN
#define ETHERNET_PHY_TXD3_PIN					3
#endif
#if !defined ETHERNET_PHY_TXD3_SCU_MODE
#define ETHERNET_PHY_TXD3_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_TX_ER
 */
#if !defined ETHERNET_PHY_TX_ER_PORT
#define ETHERNET_PHY_TX_ER_PORT					0x0C
#endif
#if !defined ETHERNET_PHY_TX_ER_PIN
#define ETHERNET_PHY_TX_ER_PIN					5
#endif
#if !defined ETHERNET_PHY_TX_ER_SCU_MODE
#define ETHERNET_PHY_TX_ER_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * ETHERNET_PHY_COL
 */
#if !defined ETHERNET_PHY_COL_PORT
#define ETHERNET_PHY_COL_PORT					9
#endif
#if !defined ETHERNET_PHY_COL_PIN
#define ETHERNET_PHY_COL_PIN					6
#endif
#if !defined ETHERNET_PHY_COL_SCU_MODE
#define ETHERNET_PHY_COL_SCU_MODE				SCU_MODE_FUNC5
#endif

#endif

/**
 * ETHERNET_PHY_INTERRUPT_PRIORITY
 */
#if !defined ETHERNET_PHY_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define ETHERNET_PHY_INTERRUPT_PRIORITY			7
#endif

