JohnnyB1290/jblib-platform-abstract-jbkernel/include/jbkernel/lpc43xx_jbdrivers_opts.h
#ifdef CORE_M0
#define ETHERNET_PHY_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 * ETHERNET_PHY_USE_DMA_ERRORS_CONTROL
 */
#if !defined ETHERNET_PHY_USE_DMA_ERRORS_CONTROL
#define ETHERNET_PHY_USE_DMA_ERRORS_CONTROL			1
#endif

#if ETHERNET_PHY_USE_DMA_ERRORS_CONTROL
/**
 * ETHERNET_PHY_DMA_ERRORS_CONTROL_TRESHOLD
 */
#if !defined ETHERNET_PHY_DMA_ERRORS_CONTROL_TRESHOLD
#define ETHERNET_PHY_DMA_ERRORS_CONTROL_TRESHOLD 			32
#endif

#endif

/**
 * ETHERNET_PHY_TX_QUEUE_SIZE
 */
#if !defined ETHERNET_PHY_TX_QUEUE_SIZE
#define ETHERNET_PHY_TX_QUEUE_SIZE			4
#endif

/**
 * ETHERNET_PHY_RX_QUEUE_SIZE
 */
#if !defined ETHERNET_PHY_RX_QUEUE_SIZE
#define ETHERNET_PHY_RX_QUEUE_SIZE			16
#endif

/**
 * ETHERNET_PHY_RX_DESCRIPTOR_BUFFER_SIZE
 */
#if !defined ETHERNET_PHY_RX_DESCRIPTOR_BUFFER_SIZE
#define ETHERNET_PHY_RX_DESCRIPTOR_BUFFER_SIZE			200
#endif

/**
 * ETHERNET_PHY_SPEED
 * ETHERNET_PHY_SPEED == SPEED_10_M		10Mbit
 * ETHERNET_PHY_SPEED == SPEED_100_M 	100Mbit
 * ETHERNET_PHY_SPEED == SPEED_AUTONEG	Autonegotiation
 * ETHERNET_PHY_SPEED == SPEED_1000_M 	1000Mbit
 *
 */
#if !defined ETHERNET_PHY_SPEED
#define ETHERNET_PHY_SPEED			SPEED_AUTONEG
#endif

/**
 * ETHERNET_PHY_USE_CONSOLE
 */
#if !defined ETHERNET_PHY_USE_CONSOLE
#define ETHERNET_PHY_USE_CONSOLE		0
#endif

/*
   ------------------------------------
   ----------- Event router -----------
   ------------------------------------
*/

/**
 * EVENT_ROUTER_INTERRUPT_PRIORITY
 */
#if !defined EVENT_ROUTER_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define EVENT_ROUTER_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define EVENT_ROUTER_INTERRUPT_PRIORITY			3
#endif

#endif

/*
   ------------------------------------
   ----------- Pin interrupt ----------
   ------------------------------------
*/

/**
 * PIN_INTERRUPT_0_INTERRUPT_PRIORITY
 */
#if !defined PIN_INTERRUPT_0_INTERRUPT_PRIORITY
#define PIN_INTERRUPT_0_INTERRUPT_PRIORITY			7
#endif

/**
 * PIN_INTERRUPT_1_INTERRUPT_PRIORITY
 */
#if !defined PIN_INTERRUPT_1_INTERRUPT_PRIORITY
#define PIN_INTERRUPT_1_INTERRUPT_PRIORITY			7
#endif

/**
 * PIN_INTERRUPT_2_INTERRUPT_PRIORITY
 */
#if !defined PIN_INTERRUPT_2_INTERRUPT_PRIORITY
#define PIN_INTERRUPT_2_INTERRUPT_PRIORITY			7
#endif

/**
 * PIN_INTERRUPT_3_INTERRUPT_PRIORITY
 */
#if !defined PIN_INTERRUPT_3_INTERRUPT_PRIORITY
#define PIN_INTERRUPT_3_INTERRUPT_PRIORITY			7
#endif

/**
 * PIN_INTERRUPT_4_INTERRUPT_PRIORITY
 */
#if !defined PIN_INTERRUPT_4_INTERRUPT_PRIORITY
#ifdef CORE_M4
#define PIN_INTERRUPT_4_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define PIN_INTERRUPT_4_INTERRUPT_PRIORITY			3
#endif
#endif

/**
 * PIN_INTERRUPT_5_INTERRUPT_PRIORITY
 */
#if !defined PIN_INTERRUPT_5_INTERRUPT_PRIORITY
#ifdef CORE_M4
#define PIN_INTERRUPT_5_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define PIN_INTERRUPT_5_INTERRUPT_PRIORITY			3
#endif
#endif

/**
 * PIN_INTERRUPT_6_INTERRUPT_PRIORITY
 */
#if !defined PIN_INTERRUPT_6_INTERRUPT_PRIORITY
#define PIN_INTERRUPT_6_INTERRUPT_PRIORITY			7
#endif

/**
 * PIN_INTERRUPT_7_INTERRUPT_PRIORITY
 */
#if !defined PIN_INTERRUPT_7_INTERRUPT_PRIORITY
#define PIN_INTERRUPT_7_INTERRUPT_PRIORITY			7
#endif

/*
   ------------------------------------
   --------------- SSP ----------------
   ------------------------------------
*/

/**
 * SSP_0_SSEL
 */
#if !defined SSP_0_SSEL_PORT
#define SSP_0_SSEL_PORT					0
#endif
#if !defined SSP_0_SSEL_PIN
#define SSP_0_SSEL_PIN					0
#endif
#if !defined SSP_0_SSEL_GPIO_PORT
#define SSP_0_SSEL_GPIO_PORT			0
#endif
#if !defined SSP_0_SSEL_GPIO_PIN
#define SSP_0_SSEL_GPIO_PIN				6
#endif
#if !defined SSP_0_SSEL_SCU_MODE
#define SSP_0_SSEL_SCU_MODE				SCU_MODE_FUNC0
#endif

/**
 * SSP_0_CLK  as alternative you can define SSP_0_CLK_NUM
 */
#if !defined SSP_0_CLK_PORT
#define SSP_0_CLK_PORT					0
#endif
#if !defined SSP_0_CLK_PIN
#define SSP_0_CLK_PIN					0
#endif
#if !defined SSP_0_CLK_SCU_MODE
#define SSP_0_CLK_SCU_MODE				SCU_MODE_FUNC0
#endif

/**
 * SSP_0_MOSI
 */
#if !defined SSP_0_MOSI_PORT
#define SSP_0_MOSI_PORT					0
#endif
#if !defined SSP_0_MOSI_PIN
#define SSP_0_MOSI_PIN					0
#endif
#if !defined SSP_0_MOSI_SCU_MODE
#define SSP_0_MOSI_SCU_MODE				SCU_MODE_FUNC0
#endif

/**
 * SSP_0_MISO
 */
#if !defined SSP_0_MISO_PORT
#define SSP_0_MISO_PORT				0
#endif
#if !defined SSP_0_MISO_PIN
#define SSP_0_MISO_PIN					0
#endif
#if !defined SSP_0_MISO_SCU_MODE
#define SSP_0_MISO_SCU_MODE			SCU_MODE_FUNC0
#endif

/**
 * SSP_0_BITS_PER_FRAME
 */
#if !defined SSP_0_BITS_PER_FRAME
#define SSP_0_BITS_PER_FRAME			SSP_BITS_8
#endif

/**
 * SSP_0_FRAMEFORMAT
 */
#if !defined SSP_0_FRAMEFORMAT
#define SSP_0_FRAMEFORMAT				SSP_FRAMEFORMAT_SPI
#endif

/**
 * SSP_0_FRAMEFORMAT
 */
#if !defined SSP_0_CLOCKMODE
#define SSP_0_CLOCKMODE					SSP_CLOCK_CPHA0_CPOL0
#endif


/**
 * SSP_1_SSEL
 */
#if !defined SSP_1_SSEL_PORT
#define SSP_1_SSEL_PORT					1
#endif
#if !defined SSP_1_SSEL_PIN
#define SSP_1_SSEL_PIN					5
#endif
#if !defined SSP_1_SSEL_GPIO_PORT
#define SSP_1_SSEL_GPIO_PORT			1
#endif
#if !defined SSP_1_SSEL_GPIO_PIN
#define SSP_1_SSEL_GPIO_PIN				8
#endif
#if !defined SSP_1_SSEL_SCU_MODE
#define SSP_1_SSEL_SCU_MODE				SCU_MODE_FUNC0
#endif

/**
 * SSP_1_CLK  as alternative you can define SSP_1_CLK_NUM
 */
#if !defined SSP_1_CLK_PORT
#define SSP_1_CLK_PORT					0
#endif
#if !defined SSP_1_CLK_PIN
#define SSP_1_CLK_PIN					0
#endif
#if !defined SSP_1_CLK_SCU_MODE
#define SSP_1_CLK_SCU_MODE				SCU_MODE_FUNC0
#endif

/**
 * SSP_1_MOSI
 */
#if !defined SSP_1_MOSI_PORT
#define SSP_1_MOSI_PORT					1
#endif
#if !defined SSP_1_MOSI_PIN
#define SSP_1_MOSI_PIN					4
#endif
#if !defined SSP_1_MOSI_SCU_MODE
#define SSP_1_MOSI_SCU_MODE				SCU_MODE_FUNC5
#endif

/**
 * SSP_1_MISO
 */
#if !defined SSP_1_MISO_PORT
#define SSP_1_MISO_PORT				1
#endif
#if !defined SSP_1_MISO_PIN
#define SSP_1_MISO_PIN					3
#endif
#if !defined SSP_1_MISO_SCU_MODE
#define SSP_1_MISO_SCU_MODE			SCU_MODE_FUNC5
#endif

/**
 * SSP_1_BITS_PER_FRAME
 */
#if !defined SSP_1_BITS_PER_FRAME
#define SSP_1_BITS_PER_FRAME			SSP_BITS_8
#endif

/**
 * SSP_0_FRAMEFORMAT
 */
#if !defined SSP_1_FRAMEFORMAT
#define SSP_1_FRAMEFORMAT				SSP_FRAMEFORMAT_SPI
#endif

/**
 * SSP_0_FRAMEFORMAT
 */
#if !defined SSP_1_CLOCKMODE
#define SSP_1_CLOCKMODE					SSP_CLOCK_CPHA0_CPOL0
#endif

