JohnnyB1290/jblib-platform-abstract-jbkernel/include/jbkernel/lpc43xx_jbdrivers_opts.h
/*
   ------------------------------------
   ------------ SGPIO SPI -------------
   ------------------------------------
*/

/**
 * SGPIO_SPI_MOSI
 */
#if !defined SGPIO_SPI_MOSI_PORT
#define SGPIO_SPI_MOSI_PORT					0
#endif
#if !defined SGPIO_SPI_MOSI_PIN
#define SGPIO_SPI_MOSI_PIN					0
#endif
#if !defined SGPIO_SPI_MOSI_SCU_MODE
#define SGPIO_SPI_MOSI_SCU_MODE				SCU_MODE_FUNC0
#endif
#if !defined SGPIO_SPI_MOSI_SLICE_ID
#define SGPIO_SPI_MOSI_SLICE_ID				N
#endif
#if !defined SGPIO_SPI_MOSI_PIN_ID
#define SGPIO_SPI_MOSI_PIN_ID				SGPIO_11
#endif

/**
 * SGPIO_SPI_MISO
 */
#if !defined SGPIO_SPI_MISO_PORT
#define SGPIO_SPI_MISO_PORT					0
#endif
#if !defined SGPIO_SPI_MISO_PIN
#define SGPIO_SPI_MISO_PIN					0
#endif
#if !defined SGPIO_SPI_MISO_SCU_MODE
#define SGPIO_SPI_MISO_SCU_MODE				SCU_MODE_FUNC0
#endif
#if !defined SGPIO_SPI_MISO_SLICE_ID
#define SGPIO_SPI_MISO_SLICE_ID				G
#endif
#if !defined SGPIO_SPI_MISO_PIN_ID
#define SGPIO_SPI_MISO_PIN_ID				SGPIO_10
#endif

/**
 * SGPIO_SPI_SCK
 */
#if !defined SGPIO_SPI_SCK_PORT
#define SGPIO_SPI_SCK_PORT					0
#endif
#if !defined SGPIO_SPI_SCK_PIN
#define SGPIO_SPI_SCK_PIN					0
#endif
#if !defined SGPIO_SPI_SCK_SCU_MODE
#define SGPIO_SPI_SCK_SCU_MODE				SCU_MODE_FUNC0
#endif
#if !defined SGPIO_SPI_SCK_SLICE_ID
#define SGPIO_SPI_SCK_SLICE_ID				D
#endif
#if !defined SGPIO_SPI_SCK_PIN_ID
#define SGPIO_SPI_SCK_PIN_ID				SGPIO_12
#endif

/**
 * SGPIO_SPI_SSEL
 */
#if !defined SGPIO_SPI_SSEL_PORT
#define SGPIO_SPI_SSEL_PORT					0
#endif
#if !defined SGPIO_SPI_SSEL_PIN
#define SGPIO_SPI_SSEL_PIN					0
#endif
#if !defined SGPIO_SPI_SSEL_SCU_MODE
#define SGPIO_SPI_SSEL_SCU_MODE				SCU_MODE_FUNC0
#endif
#if !defined SGPIO_SPI_SSEL_SLICE_ID
#define SGPIO_SPI_SSEL_SLICE_ID				P
#endif
#if !defined SGPIO_SPI_SSEL_PIN_ID
#define SGPIO_SPI_SSEL_PIN_ID				SGPIO_15
#endif

/*
   ------------------------------------
   --------------- UART ---------------
   ------------------------------------
*/

/**
 * UART_0_INTERRUPT_PRIORITY
 */
#if !defined UART_0_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define UART_0_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define UART_0_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 * UART_0_TX
 */
#if !defined UART_0_TX_PORT
#define UART_0_TX_PORT					6
#endif
#if !defined UART_0_TX_PIN
#define UART_0_TX_PIN					4
#endif
#if !defined UART_0_TX_SCU_MODE
#define UART_0_TX_SCU_MODE				SCU_MODE_FUNC2
#endif

/**
 * UART_0_RX
 */
#if !defined UART_0_RX_PORT
#define UART_0_RX_PORT					6
#endif
#if !defined UART_0_RX_PIN
#define UART_0_RX_PIN					5
#endif
#if !defined UART_0_RX_SCU_MODE
#define UART_0_RX_SCU_MODE				SCU_MODE_FUNC2
#endif

/**
 * UART_1_INTERRUPT_PRIORITY
 */
#if !defined UART_1_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define UART_1_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define UART_1_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 * UART_1_TX
 */
#if !defined UART_1_TX_PORT
#define UART_1_TX_PORT					6
#endif
#if !defined UART_1_TX_PIN
#define UART_1_TX_PIN					4
#endif
#if !defined UART_1_TX_SCU_MODE
#define UART_1_TX_SCU_MODE				SCU_MODE_FUNC2
#endif

/**
 * UART_1_RX
 */
#if !defined UART_1_RX_PORT
#define UART_1_RX_PORT					6
#endif
#if !defined UART_1_RX_PIN
#define UART_1_RX_PIN					5
#endif
#if !defined UART_1_RX_SCU_MODE
#define UART_1_RX_SCU_MODE				SCU_MODE_FUNC2
#endif

/**
 * UART_2_INTERRUPT_PRIORITY
 */
#if !defined UART_2_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define UART_2_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define UART_2_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 * UART_2_TX
 */
#if !defined UART_2_TX_PORT
#define UART_2_TX_PORT					6
#endif
#if !defined UART_2_TX_PIN
#define UART_2_TX_PIN					4
#endif
#if !defined UART_2_TX_SCU_MODE
#define UART_2_TX_SCU_MODE				SCU_MODE_FUNC2
#endif

/**
 * UART_2_RX
 */
#if !defined UART_2_RX_PORT
#define UART_2_RX_PORT					6
#endif
#if !defined UART_2_RX_PIN
#define UART_2_RX_PIN					5
#endif
#if !defined UART_2_RX_SCU_MODE
#define UART_2_RX_SCU_MODE				SCU_MODE_FUNC2
#endif

/**
 * UART_3_INTERRUPT_PRIORITY
 */
#if !defined UART_3_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define UART_3_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define UART_3_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 * UART_3_TX
 */
#if !defined UART_3_TX_PORT
#define UART_3_TX_PORT					6
#endif
#if !defined UART_3_TX_PIN
#define UART_3_TX_PIN					4
#endif
#if !defined UART_3_TX_SCU_MODE
#define UART_3_TX_SCU_MODE				SCU_MODE_FUNC2
#endif

/**
 * UART_3_RX
 */
#if !defined UART_3_RX_PORT
#define UART_3_RX_PORT					6
#endif
#if !defined UART_3_RX_PIN
#define UART_3_RX_PIN					5
#endif
#if !defined UART_3_RX_SCU_MODE
#define UART_3_RX_SCU_MODE				SCU_MODE_FUNC2
#endif

/*
   ------------------------------------
   ------------- Sys Tick -------------
   ------------------------------------
*/

/**
 * SYS_TICK_INTERRUPT_PRIORITY
 */
#if !defined SYS_TICK_INTERRUPT_PRIORITY
#define SYS_TICK_INTERRUPT_PRIORITY			7
#endif

/*
   ------------------------------------
   ------------- PWM Timer ------------
   ------------------------------------
*/

/**
 * PWM_TIMER_INTERRUPT_PRIORITY
 */
#if !defined PWM_TIMER_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define PWM_TIMER_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define PWM_TIMER_INTERRUPT_PRIORITY			3
#endif

#endif

/*
   ------------------------------------
   ------------- RI Timer -------------
   ------------------------------------
*/

/**
 * RI_TIMER_INTERRUPT_PRIORITY
 */
#if !defined RI_TIMER_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define RI_TIMER_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define RI_TIMER_INTERRUPT_PRIORITY			3
#endif

#endif

/*
   ------------------------------------
   ------------- SCT Timer ------------
   ------------------------------------
*/

/**
 * SCT_TIMER_INTERRUPT_PRIORITY
 */
#if !defined SCT_TIMER_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define SCT_TIMER_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define SCT_TIMER_INTERRUPT_PRIORITY			3
#endif

#endif

/*
   ------------------------------------
   ------------- SPIFI ----------------
   ------------------------------------
*/
/**
 * SPIFI_USE_CONSOLE
 */
#if !defined SPIFI_USE_CONSOLE
#define SPIFI_USE_CONSOLE					0
#endif

/**
 * SPIFI_FLASH_DISK_BASE_ADDRESS
 */
#if !SPIFI_FLASH_DISK_BASE_ADDRESS
#define SPIFI_FLASH_DISK_BASE_ADDRESS		SPIFLASH_BASE_ADDRESS
#endif

/**
 * SPIFI_FLASH_DISK_SIZE
 */
#if !SPIFI_FLASH_DISK_SIZE
#define SPIFI_FLASH_DISK_SIZE				(2*1024*1024)
#endif

/**
 * SPIFI_CLK
 */
#if !defined SPIFI_CLK_PORT
#define SPIFI_CLK_PORT					3
#endif
#if !defined SPIFI_CLK_PIN
#define SPIFI_CLK_PIN					3
#endif
#if !defined SPIFI_CLK_SCU_MODE
#define SPIFI_CLK_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * SPIFI_D3
 */
#if !defined SPIFI_D3_PORT
#define SPIFI_D3_PORT					3
#endif
#if !defined SPIFI_D3_PIN
#define SPIFI_D3_PIN					4
#endif
#if !defined SPIFI_D3_SCU_MODE
#define SPIFI_D3_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * SPIFI_D2
 */
#if !defined SPIFI_D2_PORT
#define SPIFI_D2_PORT					3
#endif
#if !defined SPIFI_D2_PIN
#define SPIFI_D2_PIN					5
#endif
#if !defined SPIFI_D2_SCU_MODE
#define SPIFI_D2_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * SPIFI_D1
 */
#if !defined SPIFI_D1_PORT
#define SPIFI_D1_PORT					3
#endif
#if !defined SPIFI_D1_PIN
#define SPIFI_D1_PIN					6
#endif
#if !defined SPIFI_D1_SCU_MODE
#define SPIFI_D1_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * SPIFI_D0
 */
#if !defined SPIFI_D0_PORT
#define SPIFI_D0_PORT					3
#endif
#if !defined SPIFI_D0_PIN
#define SPIFI_D0_PIN					7
#endif
#if !defined SPIFI_D0_SCU_MODE
#define SPIFI_D0_SCU_MODE				SCU_MODE_FUNC3
#endif

/**
 * SPIFI_CS
 */
#if !defined SPIFI_CS_PORT
#define SPIFI_CS_PORT					3
#endif
#if !defined SPIFI_CS_PIN
#define SPIFI_CS_PIN					8
#endif
#if !defined SPIFI_CS_SCU_MODE
#define SPIFI_CS_SCU_MODE				SCU_MODE_FUNC3
#endif

