JohnnyB1290/jblib-platform-abstract-jbkernel/include/jbkernel/lpc43xx_jbdrivers_opts.h
/*
   ------------------------------------
   ------- FRAM CY15B104Q -------------
   ------------------------------------
*/
/**
 * FRAM_CY15B104Q_USE_CONSOLE
 */
#if !defined FRAM_CY15B104Q_USE_CONSOLE
#define FRAM_CY15B104Q_USE_CONSOLE		0
#endif

/*
   ------------------------------------
   ------- Group Pin Interrupt --------
   ------------------------------------
*/

/**
 *  GROUP_PIN_INTERRUPT_0_INTERRUPT_PRIORITY
 */
#if !defined GROUP_PIN_INTERRUPT_0_INTERRUPT_PRIORITY
#define GROUP_PIN_INTERRUPT_0_INTERRUPT_PRIORITY			7
#endif

/**
 *  GROUP_PIN_INTERRUPT_1_INTERRUPT_PRIORITY
 */
#if !defined GROUP_PIN_INTERRUPT_1_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define GROUP_PIN_INTERRUPT_1_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define GROUP_PIN_INTERRUPT_1_INTERRUPT_PRIORITY			3
#endif

#endif

/*
   ------------------------------------
   --------------- I2C ----------------
   ------------------------------------
*/

/**
 * I2C_1_SDA
 */
#if !defined I2C_1_SDA_PORT
#define I2C_1_SDA_PORT					0
#endif
#if !defined I2C_1_SDA_PIN
#define I2C_1_SDA_PIN					0
#endif
#if !defined I2C_1_SDA_SCU_MODE
#define I2C_1_SDA_SCU_MODE				SCU_MODE_FUNC0
#endif

/**
 * I2C_1_SCL
 */
#if !defined I2C_1_SCL_PORT
#define I2C_1_SCL_PORT					0
#endif
#if !defined I2C_1_SCL_PIN
#define I2C_1_SCL_PIN					0
#endif
#if !defined I2C_1_SCL_SCU_MODE
#define I2C_1_SCL_SCU_MODE				SCU_MODE_FUNC0
#endif

/*
   ------------------------------------
   -------------- IPC -----------------
   ------------------------------------
*/
/**
 * IPC_SHARED_MEMORY_M4_GATE_M0APP
 */
#if !IPC_SHARED_MEMORY_M4_GATE_M0APP
#define IPC_SHARED_MEMORY_M4_GATE_M0APP			0x10007F40
#endif

/**
 * IPC_SHARED_MEMORY_M4_GATE_M0SUB
 */
#if !IPC_SHARED_MEMORY_M4_GATE_M0SUB
#define IPC_SHARED_MEMORY_M4_GATE_M0SUB			0x10007F60
#endif

/**
 * IPC_SHARED_MEMORY_M0APP_GATE_M4
 */
#if !IPC_SHARED_MEMORY_M0APP_GATE_M4
#define IPC_SHARED_MEMORY_M0APP_GATE_M4			0x10007F80
#endif

/**
 * IPC_SHARED_MEMORY_M0APP_GATE_M0SUB
 */
#if !IPC_SHARED_MEMORY_M0APP_GATE_M0SUB
#define IPC_SHARED_MEMORY_M0APP_GATE_M0SUB		0x10007FA0
#endif

/**
 * IPC_SHARED_MEMORY_M0SUB_GATE_M4
 */
#if !IPC_SHARED_MEMORY_M0SUB_GATE_M4
#define IPC_SHARED_MEMORY_M0SUB_GATE_M4			0x10007FC0
#endif

/**
 * IPC_SHARED_MEMORY_M0SUB_GATE_M0APP
 */
#if !IPC_SHARED_MEMORY_M0SUB_GATE_M0APP
#define IPC_SHARED_MEMORY_M0SUB_GATE_M0APP		0x10007FE0
#endif

/**
 * IPC_M4_INTERRUPT_PRIORITY
 */
#if !defined IPC_M4_INTERRUPT_PRIORITY
#define IPC_M4_INTERRUPT_PRIORITY				3
#endif

/**
 *  IPC_M0APP_INTERRUPT_PRIORITY
 */
#if !defined IPC_M0APP_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define IPC_M0APP_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define IPC_M0APP_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 *  IPC_M0SUB_INTERRUPT_PRIORITY
 */
#if !defined IPC_M0SUB_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define IPC_M0SUB_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define IPC_M0SUB_INTERRUPT_PRIORITY			3
#endif

#endif

/*
   ------------------------------------
   ------------ GP Timers -------------
   ------------------------------------
*/

/**
 *  GP_TIMER_0_INTERRUPT_PRIORITY
 */
#if !defined GP_TIMER_0_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define GP_TIMER_0_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define GP_TIMER_0_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 *  GP_TIMER_1_INTERRUPT_PRIORITY
 */
#if !defined GP_TIMER_1_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define GP_TIMER_1_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define GP_TIMER_1_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 *  GP_TIMER_2_INTERRUPT_PRIORITY
 */
#if !defined GP_TIMER_2_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define GP_TIMER_2_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define GP_TIMER_2_INTERRUPT_PRIORITY			3
#endif

#endif

/**
 *  GP_TIMER_3_INTERRUPT_PRIORITY
 */
#if !defined GP_TIMER_3_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define GP_TIMER_3_INTERRUPT_PRIORITY			7
#endif

#ifdef CORE_M0
#define GP_TIMER_3_INTERRUPT_PRIORITY			3
#endif

#endif

/*
   ------------------------------------
   --------- NVM Parameters -----------
   ------------------------------------
*/
/**
 * NVM_PARAMETERS_BASE_ADDRESS
 */
#if !defined NVM_PARAMETERS_BASE_ADDRESS
#define NVM_PARAMETERS_BASE_ADDRESS				(0x20040000)
#endif

/*
   ------------------------------------
   ---------------- USB ---------------
   ------------------------------------
*/
/**
 * USB_DEVICE_ROM_USE_CUSTOM_DESCRIPTORS
 */
#if !defined USB_DEVICE_ROM_USE_CUSTOM_DESCRIPTORS
#define USB_DEVICE_ROM_USE_CUSTOM_DESCRIPTORS			0
#endif

/**
 * USB_DEVICE_ROM_USE_CONSOLE
 */
#if !defined USB_DEVICE_ROM_USE_CONSOLE
#define USB_DEVICE_ROM_USE_CONSOLE						0
#endif

/* On LPC18xx/43xx the USB controller requires endpoint queue heads to start on
   a 4KB aligned memory. Hence the mem_base value passed to USB stack init should
   be 4KB aligned.
 */
/**
 * USB_DEVICE_ROM_USB0_STACK_MEM_BASE
 */
#if !defined USB_DEVICE_ROM_USB0_STACK_MEM_BASE
#define USB_DEVICE_ROM_USB0_STACK_MEM_BASE				0x20008000
#endif

/**
 * USB_DEVICE_ROM_USB0_STACK_MEM_SIZE
 */
#if !defined USB_DEVICE_ROM_USB0_STACK_MEM_SIZE
#define USB_DEVICE_ROM_USB0_STACK_MEM_SIZE				0x00004000
#endif

/**
 * USB_DEVICE_ROM_USB1_STACK_MEM_BASE
 */
#if !defined USB_DEVICE_ROM_USB1_STACK_MEM_BASE
#define USB_DEVICE_ROM_USB1_STACK_MEM_BASE				0x2000C000
#endif

/**
 * USB_DEVICE_ROM_USB1_STACK_MEM_SIZE
 */
#if !defined USB_DEVICE_ROM_USB1_STACK_MEM_SIZE
#define USB_DEVICE_ROM_USB1_STACK_MEM_SIZE				0x00004000
#endif

/**
 * USB_MAX_IF_NUM
 * Max interface number used for building USBD ROM.
 */
#if !defined USB_MAX_IF_NUM
#define USB_MAX_IF_NUM									8
#endif

/**
 * USB_MAX_EP_NUM
 *  Max number of EP used for building USBD ROM.
 */
#if !defined USB_MAX_EP_NUM
#define USB_MAX_EP_NUM									6
#endif

/**
 * USB_MAX_PACKET_EP0
 * Max EP0 packet size used for building USBD ROM.
 */
#if !defined USB_MAX_PACKET_EP0
#define USB_MAX_PACKET_EP0								64
#endif

/**
 * USB_FS_MAX_BULK_PACKET
 * MAXP for FS bulk EPs used for building USBD ROM.
 */
#if !defined USB_FS_MAX_BULK_PACKET
#define USB_FS_MAX_BULK_PACKET							64
#endif

/**
 * USB_HS_MAX_BULK_PACKET
 * MAXP for HS bulk EPs used for building USBD ROM.
 */
#if !defined USB_HS_MAX_BULK_PACKET
#define USB_HS_MAX_BULK_PACKET							512
#endif

/**
 *  USB_0_INTERRUPT_PRIORITY
 */
#if !defined USB_0_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define USB_0_INTERRUPT_PRIORITY						7
#endif

