JohnnyB1290/jblib-platform-abstract-jbkernel/include/jbkernel/lpc43xx_jbdrivers_opts.h
#ifdef CORE_M0
#define USB_0_INTERRUPT_PRIORITY						3
#endif

#endif

/**
 *  USB_1_INTERRUPT_PRIORITY
 */
#if !defined USB_1_INTERRUPT_PRIORITY

#ifdef CORE_M4
#define USB_1_INTERRUPT_PRIORITY						7
#endif

#ifdef CORE_M0
#define USB_1_INTERRUPT_PRIORITY						3
#endif

#endif

/*
   ------------------------------------
   -------- COM USB DEVICE ROM --------
   ------------------------------------
*/

/**
 * COM_USB_DEVICE_ROM_NUM_DEVICES
 */
#if !defined COM_USB_DEVICE_ROM_NUM_DEVICES
#define COM_USB_DEVICE_ROM_NUM_DEVICES					2
#endif

/**
 * COM_USB_DEVICE_ROM_CIF_NUM_USB_0
 */
#if !defined COM_USB_DEVICE_ROM_CIF_NUM_USB_0
#define COM_USB_DEVICE_ROM_CIF_NUM_USB_0				2
#endif

/**
 * COM_USB_DEVICE_ROM_DIF_NUM_USB_0
 */
#if !defined COM_USB_DEVICE_ROM_DIF_NUM_USB_0
#define COM_USB_DEVICE_ROM_DIF_NUM_USB_0				3
#endif

/**
 * COM_USB_DEVICE_ROM_IN_EP_USB_0
 */
#if !defined COM_USB_DEVICE_ROM_IN_EP_USB_0
#define COM_USB_DEVICE_ROM_IN_EP_USB_0					0x83
#endif

/**
 * COM_USB_DEVICE_ROM_OUT_EP_USB_0
 */
#if !defined COM_USB_DEVICE_ROM_OUT_EP_USB_0
#define COM_USB_DEVICE_ROM_OUT_EP_USB_0					0x03
#endif

/**
 * COM_USB_DEVICE_ROM_INT_EP_USB_0
 */
#if !defined COM_USB_DEVICE_ROM_INT_EP_USB_0
#define COM_USB_DEVICE_ROM_INT_EP_USB_0					0x84
#endif

/**
 * COM_USB_DEVICE_ROM_CIF_NUM_USB_1
 */
#if !defined COM_USB_DEVICE_ROM_CIF_NUM_USB_1
#define COM_USB_DEVICE_ROM_CIF_NUM_USB_1				2
#endif

/**
 * COM_USB_DEVICE_ROM_DIF_NUM_USB_1
 */
#if !defined COM_USB_DEVICE_ROM_DIF_NUM_USB_1
#define COM_USB_DEVICE_ROM_DIF_NUM_USB_1				3
#endif

/**
 * COM_USB_DEVICE_ROM_IN_EP_USB_1
 */
#if !defined COM_USB_DEVICE_ROM_IN_EP_USB_1
#define COM_USB_DEVICE_ROM_IN_EP_USB_1					0x83
#endif

/**
 * COM_USB_DEVICE_ROM_OUT_EP_USB_1
 */
#if !defined COM_USB_DEVICE_ROM_OUT_EP_USB_1
#define COM_USB_DEVICE_ROM_OUT_EP_USB_1					0x03
#endif

/**
 * COM_USB_DEVICE_ROM_INT_EP_USB_1
 */
#if !defined COM_USB_DEVICE_ROM_INT_EP_USB_1
#define COM_USB_DEVICE_ROM_INT_EP_USB_1					0x84
#endif

/*
   ------------------------------------
   ---------- RNDIS DEVICE ROM --------
   ------------------------------------
*/

/**
 * RNDIS_DEVICE_ROM_CIF_NUM_USB_0
 */
#if !defined RNDIS_DEVICE_ROM_CIF_NUM_USB_0
#define RNDIS_DEVICE_ROM_CIF_NUM_USB_0				0
#endif

/**
 * RNDIS_DEVICE_ROM_DIF_NUM_USB_0
 */
#if !defined RNDIS_DEVICE_ROM_DIF_NUM_USB_0
#define RNDIS_DEVICE_ROM_DIF_NUM_USB_0				1
#endif

/**
 * RNDIS_DEVICE_ROM_IN_EP_USB_0
 */
#if !defined RNDIS_DEVICE_ROM_IN_EP_USB_0
#define RNDIS_DEVICE_ROM_IN_EP_USB_0				0x81
#endif

/**
 * RNDIS_DEVICE_ROM_OUT_EP_USB_0
 */
#if !defined RNDIS_DEVICE_ROM_OUT_EP_USB_0
#define RNDIS_DEVICE_ROM_OUT_EP_USB_0				0x01
#endif

/**
 * RNDIS_DEVICE_ROM_INT_EP_USB_0
 */
#if !defined RNDIS_DEVICE_ROM_INT_EP_USB_0
#define RNDIS_DEVICE_ROM_INT_EP_USB_0				0x82
#endif

/**
 * RNDIS_DEVICE_ROM_CIF_NUM_USB_1
 */
#if !defined RNDIS_DEVICE_ROM_CIF_NUM_USB_1
#define RNDIS_DEVICE_ROM_CIF_NUM_USB_1				0
#endif

/**
 * RNDIS_DEVICE_ROM_DIF_NUM_USB_1
 */
#if !defined RNDIS_DEVICE_ROM_DIF_NUM_USB_1
#define RNDIS_DEVICE_ROM_DIF_NUM_USB_1				1
#endif

/**
 * RNDIS_DEVICE_ROM_IN_EP_USB_1
 */
#if !defined RNDIS_DEVICE_ROM_IN_EP_USB_1
#define RNDIS_DEVICE_ROM_IN_EP_USB_1				0x81
#endif

/**
 * RNDIS_DEVICE_ROM_OUT_EP_USB_1
 */
#if !defined RNDIS_DEVICE_ROM_OUT_EP_USB_1
#define RNDIS_DEVICE_ROM_OUT_EP_USB_1				0x01
#endif

/**
 * RNDIS_DEVICE_ROM_INT_EP_USB_1
 */
#if !defined RNDIS_DEVICE_ROM_INT_EP_USB_1
#define RNDIS_DEVICE_ROM_INT_EP_USB_1				0x82
#endif

/**
 * RNDIS_DEVICE_ROM_RX_QUEUE_SIZE
 */
#if !defined RNDIS_DEVICE_ROM_RX_QUEUE_SIZE
#define RNDIS_DEVICE_ROM_RX_QUEUE_SIZE				4
#endif

/**
 * RNDIS_DEVICE_ROM_TX_QUEUE_SIZE
 */
#if !defined RNDIS_DEVICE_ROM_TX_QUEUE_SIZE
#define RNDIS_DEVICE_ROM_TX_QUEUE_SIZE				4
#endif

/*
   ------------------------------------
   ----------- MSC DEVICE ROM ---------
   ------------------------------------
*/

/**
 * USE_MSC_DEVICE_ROM
 */
#if !defined USE_MSC_DEVICE_ROM
#define USE_MSC_DEVICE_ROM						0
#endif

/**
 * MSC_DEVICE_ROM_IF_NUM_USB_0
 */
#if !defined MSC_DEVICE_ROM_IF_NUM_USB_0
#define MSC_DEVICE_ROM_IF_NUM_USB_0				4
#endif

/**
 * MSC_DEVICE_ROM_IN_EP_USB_0
 */
#if !defined MSC_DEVICE_ROM_IN_EP_USB_0
#define MSC_DEVICE_ROM_IN_EP_USB_0				0x85
#endif

/**
 * MSC_DEVICE_ROM_OUT_EP_USB_0
 */
#if !defined MSC_DEVICE_ROM_OUT_EP_USB_0
#define MSC_DEVICE_ROM_OUT_EP_USB_0				0x05
#endif


#endif /* LPC43XX_JBDRIVERS_OPTS_H_ */
